---
kind: method
id: M:Autodesk.Revit.DB.VertexPair.#ctor(System.Int32,System.Int32)
source: html/5dd2caee-880d-f559-ff05-d89b906e9fa3.htm
---
# Autodesk.Revit.DB.VertexPair.#ctor Method

Constructs a new VertexPair from a pair of indices in the curve loops.

## Syntax (C#)
```csharp
public VertexPair(
	int firstVertexIdx,
	int secondVertexIdx
)
```

## Parameters
- **firstVertexIdx** (`System.Int32`)
- **secondVertexIdx** (`System.Int32`)